// firstApp.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <string>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    // Завдання 1
    // Розробити алгоритм та написати програму, в якій здійснюється читання значення певної довжини в дюймах і обчислюється й виводиться значення цієї довжини в міліметрах (1 дюйм = 25,4 мм).

    //float inch, mm;
    //cout << "Введите значение в дюймах, чтобы получить миллиметры ";
    //cin >> inch;
    //mm = inch * 25.4;
    //inch >= 0 ? cout << "Ваше значение в миллиметрах = " << mm  : cout << "Введены не правельные данные" ;


    
    //Завдання 2
    //Розробити алгоритм та написати програму, яка зчитує вісім значень і повертає середнє арифметичне.

    //int a, b, c, d, e, f, g, h, result;
    //cout << "Введите 8 цифр чтобы получить среднее арифметическое ";
    //cin >> a >> b >> c >> d >> e >> f >> g >> h;
    //result = (a + b + c + d + e + f + g + h) / 8;
    //cout << "Среднее арифметическое = " << result;


    //Завдання 3
    // Розробити алгоритм та написати програму, яка зчитує значення змінної n цілого типу й обчислює n!

    //int n, result;
    //cout << "Введите число факториал которого Вы хотите посчитать ";
    //cin >> n;
    //result = 1;
    //while (n != 1) {
    //    result *= n;
    //    n--;
    //}
    //cout << "Факториал введенного числа " << " = " << result;



    //1.3 Індивідуальне завдання

    //    Розробити алгоритм програми, яка обчислює значення функції в заданому діапазоні.Програма повинна прочитати значення початку і кінця інтервалу, крок збільшення аргументу і значення n.

    //    Алгоритм повинен бути представлений з використанням UML - діаграми діяльності.Алгоритм повинен містити такі частини :

    //зчитування даних
    //    основний цикл, у якому встановлюється нове значення аргументу, розраховується значення функції, виводяться на екран значення аргументу і функції та здійснюється збільшення значення аргументу на величину кроку.

    //    Конкретна функція визначається відповідно до номеру в списку студентів у групах(номер варіанту).

    //int a, b, h, n, y, i, j, s;
    //cin >> a >> b >> h >> n;
    //if (n > 1 || n == 0) {
    //    int x = a;
    //    do {

    //        if (x < 0) {
    //            y = 1;
    //            i = 1;
    //            s = 0;
    //            j = 1;
    //            do {
    //                do {
    //                    s += pow((x - pow(i, 2) + j), 2); // pow - возведение в степень
    //                    j++;
    //                } while (j < n);
    //                y *= s;
    //                i++;
    //            } while (i < n);
    //        } 
    //        
    //        else if (x >= 0) {
    //            y = 0;
    //            i = 0;
    //            do {
    //                y += (x - 1) / (i + 1);
    //                i++;
    //            } while (i <= n);
    //        }

    //        else {
    //            cout << "error x " << x << endl;
    //        }

    //        cout << "x = " << x << " y = " << y << endl;
    //        x += h;
    //    } while (x <= b);
    //    cout << "end";
    //}
    //else if (n < 0) {
    //    cout << "incorrect n";
    //}

    //Лабораторна робота 2

    float a, b, c, x1, x2, d;
    cin >> a >> b >> c;
    if (a == 0) {
        if (b == 0) {
            cout << "Бесконечное количевство корней";
        }

        else if (b != 0) {
            if (c == 0) {
                cout << "Нет корней";
            }
            else if (c != 0) {
                x1 = -c / b;
                cout << x1;
            }
        }
    }

    else if (a != 0) {
        d = pow(b, 2) - 4 * a * c;
        if (d < 0) {
            cout << "Нет корней";
        }
        else if (d > 0) {
            x1 = (-b + pow(d, 1 / 2) / 2 * a);
            x2 = (-b - pow(d, 1 / 2) / 2 * a);
            cout << x1 << " , " << x2;
        }
        else if (d == 0) {
            x1 = -b / 2a;
            cout << x1;
        }
    }
}
