// firstApp.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <string>

using namespace std;

int main()
{
    // Завдання 1
    // Розробити алгоритм та написати програму, в якій здійснюється читання значення певної довжини в дюймах і обчислюється й виводиться значення цієї довжини в міліметрах (1 дюйм = 25,4 мм).

    //float inch, mm;
    //cin >> inch;
    //mm = inch * 25.4;
    //inch >= 0 ? cout << mm  : cout << "Введены не правельные данные" ;

    //Завдання 3
    // Розробити алгоритм та написати програму, яка зчитує значення змінної n цілого типу й обчислює n!
    
    //int num, result;
    //result = num;

    //string name;
    //cout << "Enter your name: ";
    //getline(cin, name); //cin >> name; getline записывает до пробела
    //if (name.length() != 0)
    //    cout << "Hello " << name << endl;
    //else
    //    cout << "hello" << endl;

    //for (int counter = 0; counter < 10; counter++){
    //    cout << " " << counter << endl;
    //}

    //int n, result;
    //cin >> n;
    //result = n;
    //for (int i = n - 1; i > 1; i--) {
    //    result *= i;
    //}
    //cout << result;

    //while (i < 20) {
    //    cout << " " << i;
    //    i++;
    //}

    //do {
    //    cout << " " << i;
    //    i++;
    //} while (i < 0);

    //cout << "Random number = " << 1 + rand() % 80 << endl; //генераци рандомного числа от 0 до 80

    //1.3 Індивідуальне завдання

    //    Розробити алгоритм програми, яка обчислює значення функції в заданому діапазоні.Програма повинна прочитати значення початку і кінця інтервалу, крок збільшення аргументу і значення n.

    //    Алгоритм повинен бути представлений з використанням UML - діаграми діяльності.Алгоритм повинен містити такі частини :

    //зчитування даних
    //    основний цикл, у якому встановлюється нове значення аргументу, розраховується значення функції, виводяться на екран значення аргументу і функції та здійснюється збільшення значення аргументу на величину кроку.

    //    Конкретна функція визначається відповідно до номеру в списку студентів у групах(номер варіанту).
    
    int a, b, h, n, y, i, j, s;
    cin >> a >> b >> h >> n;
    if (n > 1 || n == 0) {
        int x = a;
        do {
            if (x < 0) {
                y = 1;
                i = 1;
                do {
                    s = 0;
                    j = 1;
                    do {
                        s += pow((x - pow(i, 2) + j), 2); // pow - возведение в степень
                        j++;
                    } while (j < n);
                    do {
                        y *= s;
                        i++;
                    } while (j >= n);
                } while (i <= n);
            } if (x >= 0) {
                y = 0;
                i = 0;
                do {
                    y += (x - 1) / (i + 1);
                    i++;
                } while (i < n);
            }
            else {
                cout << "Error x";
            }
            cout << "X = " << x << " Y = " << y << endl;
            x += h;
        } while (x <= b);
        cout << "End";
    }
    if (n < 0) {
        cout << "Incorrect n";
    }
}
