#include <iostream>
#include <string>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    //Лабораторна робота 1

    // Завдання 1
    // Розробити алгоритм та написати програму, в якій здійснюється читання значення певної довжини в дюймах і обчислюється й виводиться значення цієї довжини в міліметрах (1 дюйм = 25,4 мм).

    float inch, mm;
    cout << "Введите значение в дюймах, чтобы получить миллиметры " << endl;
    cin >> inch;
    mm = inch * 25.4;
    inch >= 0 ? cout << "Ваше значение в миллиметрах = " << mm << " мм"<< endl : cout << "Введены неправильные данные" << endl;
    return 0;
}
